Конфигурация/Documents/СведенияОРегистрацииПраваСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СведенияОРегистрацииПраваСобственности</Name>
			<BasedOn>
				<xr:Item>Document.СделкаСНедвижимостью</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияСделокСНедвижимостью</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСНедвижимостью</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регистратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСвидетельства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключатьВСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСвидетельства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияСделокСНедвижимостью.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияСделокСНедвижимостью</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлановаяДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктПриемаПередачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктПриемаПередачиОбъектовНедвижимости</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводПрочихАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СведенияОГосРегистрацииПраваСобственности</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СведенияОРегистрацииПраваСобственности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСНедвижимостью</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ЗадолженностиПоДенежнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоДенежнымСредствам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Documents/АктПриемаПередачиОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>АктПриемаПередачиОбъектовНедвижимости</Name>
			<BasedOn>
				<xr:Item>Document.СделкаСНедвижимостью</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияСделокСНедвижимостью</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСНедвижимостью</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключатьВСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимостиПоДДУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/СведенияОРегистрацииПраваСобственности/Ext/ObjectModule.bsl
Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	// Получение списка проводок вынесено в модуль менеджера
	НаборПроводок = Документы.АктПриемаПередачиОбъектовНедвижимости.ПодготовитьНаборПроводок(
		ЭтотОбъект.Ссылка, 
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления,
		УчетныйРегистр, 
		Отказ);
				
	Если Отказ ИЛИ НаборПроводок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТЗПроводок = НаборПроводок.Выгрузить();
	ТЗПроводок.ЗаполнитьЗначения(ЭтотОбъект.Ссылка, "Регистратор");
	Движения[УчетныйРегистр].Загрузить(ТЗПроводок);  

КонецПроцедуры

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	Движения.УсловияСделокСНедвижимостью.Записывать = Истина;
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка.Дата КАК Период,
		|	УсловияСделокСНедвижимостьюСрезПоследних.Организация КАК Организация,
		|	УсловияСделокСНедвижимостьюСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	УсловияСделокСНедвижимостьюСрезПоследних.Основание КАК Основание,
		|	УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	УсловияСделокСНедвижимостьюСрезПоследних.ПлановаяДатаПередачи КАК ПлановаяДатаПередачи,
		|	УсловияСделокСНедвижимостьюСрезПоследних.Сумма КАК Сумма,
		|	УсловияСделокСНедвижимостьюСрезПоследних.СтавкаНДС КАК СтавкаНДС,
		|	УсловияСделокСНедвижимостьюСрезПоследних.СуммаНДС КАК СуммаНДС,
		|	&Ссылка КАК СведенияОГосРегистрацииПраваСобственности,
		|	УсловияСделокСНедвижимостьюСрезПоследних.АктПриемаПередачи КАК АктПриемаПередачи,
		|	УсловияСделокСНедвижимостьюСрезПоследних.Отменено КАК Отменено
		|ИЗ
		|	Документ.СведенияОРегистрацииПраваСобственности.ОбъектыНедвижимости КАК СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
		|				&МоментВремени,
		|				Основание = &Основание
		|					И ОбъектНедвижимости В
		|						(ВЫБРАТЬ
		|							СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости
		|						ИЗ
		|							Документ.СведенияОРегистрацииПраваСобственности.ОбъектыНедвижимости КАК СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости
		|						ГДЕ
		|							СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка = &Ссылка)) КАК УсловияСделокСНедвижимостьюСрезПоследних
		|		ПО СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.ОбъектНедвижимости = УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости
		|ГДЕ
		|	СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(ЭтотОбъект.МоментВремени(),ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Основание", ЭтотОбъект.Основание);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Движения.УсловияСделокСНедвижимостью.Загрузить(РезультатЗапроса.Выгрузить());
	
	Если ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.СделкаСНедвижимостью") Тогда
		Документы.АктПриемаПередачиОбъектовНедвижимости.ОтразитьНДСНаРегистрахБэкОФиса(ЭтотОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СделкаСНедвижимостью") Тогда
		
		ЭтотОбъект.Дата = ТекущаяДата();
		ЭтотОбъект.СчетДоверительногоУправления = ДанныеЗаполнения.СчетДоверительногоУправления; 
		ЭтотОбъект.Основание = ДанныеЗаполнения;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости КАК ОбъектНедвижимости,
			|	УсловияСделокСНедвижимостьюСрезПоследних.ПлановаяДатаПередачи КАК ПлановаяДатаПередачи
			|ИЗ
			|	РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
			|			&ТекущаяДата,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И Основание = &Основание) КАК УсловияСделокСНедвижимостьюСрезПоследних
			|ГДЕ
			|	НЕ УсловияСделокСНедвижимостьюСрезПоследних.Отменено
			|	И УсловияСделокСНедвижимостьюСрезПоследних.СведенияОГосРегистрацииПраваСобственности = ЗНАЧЕНИЕ(Документ.СведенияОРегистрацииПраваСобственности.)";
		
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Основание", ЭтотОбъект.Основание);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ТекущаяДата", ЭтотОбъект.Дата);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Строка = ЭтотОбъект.ОбъектыНедвижимости.Добавить();
			Строка.ОбъектНедвижимости  = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОбъектыДокумента.ОбъектНедвижимости КАК ОбъектНедвижимости,
			|	_ОбъектыДокумента.НомерСтроки КАК НомерСтроки
			|ПОМЕСТИТЬ _ПоДокументу
			|ИЗ
			|	&ОбъектыДокумента КАК _ОбъектыДокумента
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ПоДокументу.ОбъектНедвижимости КАК ОбъектНедвижимости,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ПоДокументу.НомерСтроки) КАК КоличествоСтрок,
			|	МИНИМУМ(ЕСТЬNULL(СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка, ЗНАЧЕНИЕ(Документ.СведенияОРегистрацииПраваСобственности.))) КАК ДругаяРегистрацияСобственности,
			|	МИНИМУМ(_ПоДокументу.НомерСтроки) КАК ПерваяСтрока
			|ПОМЕСТИТЬ _ОшибкиДокумента
			|ИЗ
			|	_ПоДокументу КАК _ПоДокументу
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОРегистрацииПраваСобственности.ОбъектыНедвижимости КАК СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости
			|		ПО _ПоДокументу.ОбъектНедвижимости = СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.ОбъектНедвижимости
			|			И (СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка <> &Ссылка)
			|			И (СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка.Основание = &Основание)
			|			И (СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка.Организация = &Организация)
			|			И (СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка.СчетДоверительногоУправления = &СчетДоверительногоУправления)
			|			И (СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка.Дата <= &Дата)
			|
			|СГРУППИРОВАТЬ ПО
			|	_ПоДокументу.ОбъектНедвижимости
			|
			|ИМЕЮЩИЕ
			|	(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ПоДокументу.НомерСтроки) > 1
			|		ИЛИ МИНИМУМ(СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка) ЕСТЬ НЕ NULL )
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОшибкиДокумента.ОбъектНедвижимости КАК ОбъектНедвижимости,
			|	_ОшибкиДокумента.КоличествоСтрок КАК КоличествоСтрок,
			|	_ОшибкиДокумента.ДругаяРегистрацияСобственности КАК ДругаяРегистрацияСобственности,
			|	_ОшибкиДокумента.ПерваяСтрока КАК ПерваяСтрока,
			|	СведенияОРегистрацииПраваСобственности.Представление КАК ПредставлениеРегистрацииСобственности,
			|	СправочникОбъектыНедвижимости.Представление КАК ПредставлениеОбъекта
			|ИЗ
			|	_ОшибкиДокумента КАК _ОшибкиДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыНедвижимости КАК СправочникОбъектыНедвижимости
			|		ПО _ОшибкиДокумента.ОбъектНедвижимости = СправочникОбъектыНедвижимости.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОРегистрацииПраваСобственности КАК СведенияОРегистрацииПраваСобственности
			|		ПО _ОшибкиДокумента.ДругаяРегистрацияСобственности = СведенияОРегистрацииПраваСобственности.Ссылка";
		
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Основание", ЭтотОбъект.Основание);
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ОбъектыДокумента", ЭтотОбъект.ОбъектыНедвижимости.Выгрузить(,"ОбъектНедвижимости, НомерСтроки"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.КоличествоСтрок > 1 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Объект """ + ВыборкаДетальныеЗаписи.ПредставлениеОбъекта 
					+ """, указанный в строке " + ВыборкаДетальныеЗаписи.ПерваяСтрока + " встречается в документе несколько раз!", 
					ЭтотОбъект, "ОбъектыНедвижимости[" + (ВыборкаДетальныеЗаписи.ПерваяСтрока - 1) + "].ОбъектНедвижимости", ,Отказ);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДругаяРегистрацияСобственности) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для объекта """ + ВыборкаДетальныеЗаписи.ПредставлениеОбъекта 
					+ """, указанного в строке " + ВыборкаДетальныеЗаписи.ПерваяСтрока 
					+ " ранее уже было зарегистрировано право собственности (" + ВыборкаДетальныеЗаписи.ПредставлениеРегистрацииСобственности + ")!", 
					ЭтотОбъект, "ОбъектыНедвижимости[" + (ВыборкаДетальныеЗаписи.ПерваяСтрока - 1) + "].ОбъектНедвижимости", ,Отказ);
			КонецЕсли;
				
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью

Процедура ПередУдалением(Отказ)
	
	// заполнение доп. свойств объекта перед удалением, т.к
	// в дальнейшем происходит обращение к доп. св-вам ЭтоНовый и ПредЗначенияРеквизитовШапки
	// при устанвке блокровки ЖурналОперацийБэкОфиса
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	РаботаСЖурналамиОпераций.ПередУдалениемДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПриЗаписи

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаПроведения
#КонецОбласти
